als-about.org
#+title:【关于】-阿亮的空间说明文档
#+author:alaing
#+date:2016-11-22
* 网站说明
不想拖延，不想因为想的太多而做的太少而痛苦，一直觉得大多时候忙碌的时候总是让心变简单。
刚刚完成了网站我希望达到的最基本的功能，写个说明文档。开个头，后面不断的补充。
** 【初衷】
现在2016-07-09，外面夜很宁静，喜欢这种大城市喧嚣背后这种寂静的心境。
大三结束了，接下来60多天的暑假，然后准备校园招聘会。之前一直忙于2014年11月大二上开始的实习，
做着实习单位所谓的大学生软件服务外包的项目，都是项目需要什么学习什么，学校课上安排什么学习什么。

2016年06月27日，正式从待了21个月的实习单位离职。暑假两个月，打算系统的梳理复习一下大学期间打算学到的知识，
最初在CSDN上花一天折腾了一个博客，打算记录学习的知识。后面想着自己还要准备个简历，我觉得青春充满无限幻想，
喜欢折腾，相信明天会更好。结合博客和简历两个需求，便产生了现在这个阿亮的空间。

后续的完善，只有起点，没有终点。
** 【个人介绍】
记录总数：1
**** 2016-07-09
** 【建站记录】
记录总数：3
**** 2016-07-09
上个月27日离职，放松思考了几天。月初开始边学边做，中间继续上着专业数据库设计的短学期，学着驾校。1周完成了1.0的版本.

因为需求只是自己一个人写博客，展示简历和过往经验，也就做的很简单。现在也只是做了显示博文这一个功能.
**** 2016-10-05
精简内容，优化布局。
**** 2017-01-18
更新Css
* 博文目录-按标签
文档总数：26
** 【笔记】-心灵||信仰（善良&&真诚）
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/1.html][关于代码整洁]]
** 【笔记】-面试准备
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/22.html][2016秋招远程查看项目说明]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/23.html][问题1]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/24.html][问题2]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/25.html][问题3]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201609/1.html][2016秋季找工作杂谈]]
** 【热爱】-逻辑||思维
暂无。
** 【热爱】-Linux
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/3.html][linux常用命令]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/4.html][linux下安装emacs]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/5.html][linux下配置emacs]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/11.html][linux下安装texlive2016]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/12.html][解决latex转pdf时不兼容中文]]
** 【热爱】-Emacs||Github
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/6.html][emacs常用快捷键]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/7.html][emacs解除read-only时buffer的锁定]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/8.html][emacs的多窗口操作]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/9.html][org常用快捷键]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/10.html][org参考文档]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/13.html][利用github创建个人博客]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/14.html][github添加deploy keys]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/15.html][git常用bash命令]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/16.html][github提交代码到github仓库]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/17.html][删除github上的repository]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/18.html][单独删除github仓库中的某个文件]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/19.html][解决git push时non-fast-forward的问题]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/20.html][github上创建分支]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/21.html][github插件octotree]]
** 【必备】-算法||数据结构
暂无。
** 【技能】-后端：C#
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1104-20161108.html][CLR学习（1)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1103-20161108.html][CLR学习（2)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1102-20161108.html][JIT编译器]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1101-20161108.html][高级语言虚拟机]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1100-20161109.html][CLR学习（3)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1099-20161115.html][CLR学习（4)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1098-20161115.html][CLR学习（5)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1097-20161118.html][C#单元测试（1）]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1096-20161118.html][C#单元测试（2）]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1095-20161123.html][C#单元测试（3）]]
** 【技能】-数据库：Mysql||Sqlserver
暂无。
** 【技能】-前端：Web
暂无。
** 【必备】-计算机网络
暂无。
** 【必备】-操作系统||服务器
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/2.html][win10快捷键]]
* 博文目录-按年月
文档总数：27
** 【2016年11月】
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1104-20161108.html][CLR学习（1)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1103-20161108.html][CLR学习（2)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1102-20161108.html][JIT编译器]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1101-20161108.html][高级语言虚拟机]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1100-20161109.html][CLR学习（3)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1099-20161115.html][CLR学习（4)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1098-20161115.html][CLR学习（5)]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1097-20161118.html][C#单元测试（1）]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1096-20161118.html][C#单元测试（2）]]
****  [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201611/d1095-20161123.html][C#单元测试（3）]]
** 【2016年09月】
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201609/1.html][2016秋季找工作杂谈]]
** 【2016年07月】
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/1.html][关于代码整洁]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/2.html][win10快捷键]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/3.html][linux常用命令]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/4.html][linux下安装emacs]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/5.html][linux下配置emacs]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/6.html][emacs常用快捷键]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/7.html][emacs解除read-only时buffer的锁定]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/8.html][emacs的多窗口操作]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/9.html][org常用快捷键]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/10.html][org参考文档]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/11.html][linux下安装texlive2016]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/12.html][解决latex转pdf时不兼容中文]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/13.html][利用github创建个人博客]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/14.html][github添加deploy keys]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/15.html][git常用bash命令]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/16.html][github提交代码到github仓库]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/17.html][删除github上的repository]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/18.html][单独删除github仓库中的某个文件]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/19.html][解决git push时non-fast-forward的问题]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/20.html][github上创建分支]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/21.html][github插件octotree]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/22.html][2016秋招远程查看项目说明]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/23.html][问题1]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/24.html][问题2]]
**** [[file:http://www.anbgsl1110-dms-aliang.space/anbgsl1110.github.io/diary/201607/25.html][问题3]]
* 事件记录
** 【版本记录】
记录总数：3
**** V1.0---2016-07-09
完成基本的功能。。
**** V2.0---2016-10-05
改变布局和风格。。
**** V3.0---2017-01-18
更新Css文件。。
** 【架构记录】
记录总数：1
***** A1.0---2016-07-09
**** 【其他记录】
暂无其他事件记录。

* 感谢
* 链接
